In [1]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split

def readData(filename):
    return pd.read_csv(filename)

dataset = readData("train.csv")
numCols = dataset.shape[1]

np.random.seed(42)

#Split the datset into train and test, then into features and labels
dataTrain, dataTest = train_test_split(dataset, test_size=.2)
labelsTrain = dataTrain.iloc[:, numCols-1:]
dataTrain = dataTrain.iloc[:, :numCols-1]
labelsTest = dataTest.iloc[:, numCols-1:]
dataTest = dataTest.iloc[:, :numCols-1]

In [2]:
dataTrain.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin
331,332,0,1,"Partner, Mr. Austen",male,45.5,0,0,113043,28.5000,C124
733,734,0,2,"Berriman, Mr. William John",male,23.0,0,0,28425,13.0000,NaN
382,383,0,3,"Tikkanen, Mr. Juho",male,32.0,0,0,STON/O 2. 3101293,7.9250,NaN
704,705,0,3,"Hansen, Mr. Henrik Juul",male,26.0,1,0,350025,7.8542,NaN
813,814,0,3,"Andersson, Miss. Ebba Iris Alfrida",female,6.0,4,2,347082,31.2750,NaN